__all__ = ['Mmd_Skeleton']

class Mmd_Skeleton:

    def __init__(self):
      self.simplify_bone_color = []
      self.simplify_bone_parents= []
      for bone_i in self.simplify_bones:
          index_in_sim = self.simplify_bones.index(bone_i)
          if index_in_sim < 3:
              self.simplify_bone_color.append(self.simplify_color[0])
          elif index_in_sim < 8:
              self.simplify_bone_color.append(self.simplify_color[1])
          elif index_in_sim < 12:
              self.simplify_bone_color.append(self.simplify_color[2])
          elif index_in_sim < 16:
              self.simplify_bone_color.append(self.simplify_color[3])
          elif index_in_sim < 38:
              self.simplify_bone_color.append(self.simplify_color[4])
          elif index_in_sim < 60:
              self.simplify_bone_color.append(self.simplify_color[5])

          if self.bones_parent[bone_i] not in self.simplify_bones:
              self.simplify_bone_parents.append(-1)
          else:
              self.simplify_bone_parents.append(self.simplify_bones.index(self.bones_parent[bone_i]))
    debug_bones = [
      # "全ての親",
      "上半身",
      # "上半身2",
      # "首",
      # "頭",
      # "下半身",
      # "右足",
      # "左手首",
      #   "左親指１",
      #   "左親指２",
      #   "左人指１",
      #   "左人指２",
      #   "左人指３",
      #   "左中指１",
      #   "左中指２",
      #   "左中指３",
      #   "左薬指１",
      #   "左薬指２",
      #   "左薬指３",
        # "左小指１",
        # "左小指２",
        # "左小指３",
    ]

    simplify_bones = [#进行一个分段排序
      # "全ての親",
        # "左足IK親",
        # "右足IK親", #以上是位置不改变的
        # "左足ＩＫ",
        # "右足ＩＫ",
        # "右つま先ＩＫ",#位置改变但可以不考虑的，足ik位置和足首一样，つま先ＩＫ可以保留
        # "センター",
        # "グルーブ",# 会显示类似尾巴的东西所以也先不考虑
        # "センターdebug",
        # "グルーブdebug",
        # "腰",
        "下半身",
        "上半身",
        "上半身2",#主要肢体[0:3)
        "首",
        "頭",
        "両目",
        "左目",
        "右目",#肩以上[3:8)
        "左足",
        "左ひざ",
        "左足首",
        "左つま先",#左脚[8,12)
        "右足",
        "右ひざ",
        "右足首",
        "右つま先",#右脚[12,16)
        "左肩P",
        "左肩",
        "左腕",
        "左ひじ",
        "左手首",
        "左腕捩",
        "左手捩",
        "左親指０",
        "左親指１",
        "左親指２",
        "左人指１",
        "左人指２",
        "左人指３",
        "左中指１",
        "左中指２",
        "左中指３",
        "左薬指１",
        "左薬指２",
        "左薬指３",
        "左小指１",
        "左小指２",
        "左小指３",#[16,38)
        "右肩P",
        "右肩",
        "右腕",
        "右ひじ",
        "右手首",
        "右腕捩",
        "右手捩",
        "右親指０",
        "右親指１",
        "右親指２",
        "右人指１",
        "右人指２",
        "右人指３",
        "右中指１",
        "右中指２",
        "右中指３",
        "右薬指１",
        "右薬指２",
        "右薬指３",
        "右小指１",
        "右小指２",
        "右小指３",#[38,60)
    ]
    simplify_color = ['darkorange','salmon','deepskyblue','forestgreen','deeppink','gold']
    bones_parent = {
        "全ての親": None,
        "センター": "全ての親",
        "下半身":"腰",
        "左足":"下半身",
        "左ひざ":"左足",
        "左足首":"左ひざ",
        "左足ＩＫ":"左足IK親",
        # "左つま先ＩＫ":"左足ＩＫ",
        "左つま先":"左足首",#由于足IK的父节点足IK親一般不动，所以直接和足首连接
        # "左つま先ＩＫ":"左足首",#由于足IK的父节点足IK親一般不动，所以直接和足首连接
        "右足":"下半身",
        "右ひざ":"右足",
        "右足首":"右ひざ",
        "右足ＩＫ":"右足IK親",
        # "右つま先ＩＫ":"右足ＩＫ",
        "右つま先":"右足首",#由于足IK的父节点足IK親一般不动，所以直接和足首连接
        # "右つま先ＩＫ":"右足首",#由于足IK的父节点足IK親一般不动，所以直接和足首连接
        "上半身":"腰",
        "上半身2":"上半身",
        "首":"上半身2",
        "頭":"首",
        "左肩":"左肩P",
        "左腕":"左肩",
        "左ひじ":"左腕捩",
        "左手首":"左手捩",
        "左親指０":"左手首",
        "左親指１":"左親指０",
        "左親指２":"左親指１",
        "左人指１":"左手首",
        "左人指２":"左人指１",
        "左人指３":"左人指２",
        "左中指１":"左手首",
        "左中指２":"左中指１",
        "左中指３":"左中指２",
        "左薬指１":"左手首",
        "左薬指２":"左薬指１",
        "左薬指３":"左薬指２",
        "左小指１":"左手首",
        "左小指２":"左小指１",
        "左小指３":"左小指２",
        "右肩":"右肩P",
        "右腕":"右肩",
        "右ひじ":"右腕捩",
        "右手首":"右手捩",
        "右親指０":"右手首",
        "右親指１":"右親指０",
        "右親指２":"右親指１",
        "右人指１":"右手首",
        "右人指２":"右人指１",
        "右人指３":"右人指２",
        "右中指１":"右手首",
        "右中指２":"右中指１",
        "右中指３":"右中指２",
        "右薬指１":"右手首",
        "右薬指２":"右薬指１",
        "右薬指３":"右薬指２",
        "右小指１":"右手首",
        "右小指２":"右小指１",
        "右小指３":"右小指２",
        "左腕捩":"左腕",
        "右腕捩":"右腕",
        "左肩P":"上半身2",
        "右肩P":"上半身2",
        "両目":"頭",
        "左目":"頭",
        "右目":"頭",
        "グルーブ":"センター",
        "腰":"グルーブ",
        "左足IK親":"全ての親",
        "右足IK親":"全ての親",
        "左手捩":"左ひじ",
        "右手捩":"右ひじ",
        
        
    }
    
    standard_bones = [
        "全ての親",
        "センター",
        "下半身",
        "左足",
        "左ひざ",
        "左足首",
        "左足ＩＫ",
        "左つま先ＩＫ",
        "右足",
        "右ひざ",
        "右足首",
        "右足ＩＫ",
        "右つま先ＩＫ",
        "上半身",
        "上半身2",
        "首",
        "頭",
        "左肩",
        "左腕",
        "左ひじ",
        "左手首",
        "左親指１",
        "左親指２",
        "左人指１",
        "左人指２",
        "左人指３",
        "左中指１",
        "左中指２",
        "左中指３",
        "左薬指１",
        "左薬指２",
        "左薬指３",
        "左小指１",
        "左小指２",
        "左小指３",
        "右肩",
        "右腕",
        "右ひじ",
        "右手首",
        "右親指１",
        "右親指２",
        "右人指１",
        "右人指２",
        "右人指３",
        "右中指１",
        "右中指２",
        "右中指３",
        "右薬指１",
        "右薬指２",
        "右薬指３",
        "右小指１",
        "右小指２",
        "右小指３",
        "左腕捩",
        "右腕捩",
        "左肩P",
        "右肩P",
        "両目",
        "左目",
        "右目",
        "グルーブ",
        "腰",
        "左足IK親",
        "右足IK親",
        "左手捩",
        "右手捩",
        "左親指０",
        "右親指０"
    ]

    default_frame = {
      "BoneName": "Default",
      "Curve": {
        "r": [
          20,
          20,
          107,
          107
        ],
        "x": [
          20,
          20,
          107,
          107
        ],
        "y": [
          20,
          20,
          107,
          107
        ],
        "z": [
          20,
          20,
          107,
          107
        ]
      },
      "FrameTime": 0,
      "Position": {
        "x": 0.0,
        "y": 0.0,
        "z": 0.0
      },
      "Rotation": {
        "w": 1.0,
        "x": 0.0,
        "y": 0.0,
        "z": 0.0
      }
    }
    bone_correction_mapping = {
        # "m33.json": {
        #     "両目ハイライト": "両目",
        #     "左目ハイライト": "左目",
        #     "右目ハイライト": "右目"
        # },
        # "m42.json": {
        #     "default": ["両目"]
        # },
        "m20.json": {
            "左肩上1": "左肩P",
            "右肩上1": "右肩P"
        },
        # "m27.json": {
        #     "default": ["グルーブ", "腰", "左足IK親", "右足IK親", "左肩P", "右肩P", "左手捩", "右手捩", "左親指０", "右親指０"],
        #     "左腕２": "左腕捩",
        #     "右腕２": "右腕捩",
        # },
        # "m97.json": {
        #     "左肩上1": "左肩P",
        #     "右肩上1": "右肩P"
        # },
        # "m105.json": {
        #     "default": ["左肩P", "右肩P"]
        # },
    }

    


    